{ 
	"l_1":  { "lang": "Grafilogika ismertető" },
	"l_2":  { "lang": "A grafilogika története, szabályai" },
	"l_3":  { "lang": "Megoldási tippek: fekete-fehér rejtvény" },
	"l_4":  { "lang": "Megoldási tippek: színes rejtvény" },
	"l_5":  { "lang": "A szoftver használata" },
	"l_6":  { "lang": "A grafilogika története, szabályai" },
	"l_7":  { "lang": "A grafilogika olyan logikai rejtvényfajta, melyben egy négyzetrácsos lapon kell a négyzeteket úgy beszínezni, hogy megfejtésül egy elrejtett ábrát, képet kapjunk. A lap oldalán és tetején levő számozás segít a megfejtésben." },
	"l_8":  { "lang": "Eredetileg az ábra fekete-fehér kockákból állt össze, de már igen elterjedtek a színes változatok is." },
	"l_9":  { "lang": "A grafilogika egyéb elnevezései: nonogram, paint by number, picross, pic-a-pix, griddlers, hanji." },
	"l_10": { "lang": "A grafilogika története" },
	"l_11": { "lang": "Ez a rejtvényfajta egy japán dizájner ötlete alapján született meg.  Non Ishida 1986-ban úgy nyert meg egy grafikai versenyt, hogy egy tokiói felhőkarcoló egyes ablakait kivilágította, másokat pedig elsötétített, így távolról nézve egy ábra alakult ki az épület falán." },
	"l_12": { "lang": "Non Ishida 1988-ban 3 rejtvényt publikált Japánban Window Art Puzzles néven." },
	"l_13": { "lang": "Nagyjából ebben az időben Mr. Tetsuya Nishio a fenti történettől függetlenül szintén megjelentetett egy ilyen rejtvényt egy másik magazinban." },
	"l_14": { "lang": "1989-ben Non Ishida a rejtvényt megmutatta James Dalgety-nek, aki sok fantáziát látott benne, és megállapodtak, hogy népszerűsítik a rejtvényfajtát  Japánon kívül is. A rejtvény a nonogram nevet kapta, és rendszeresen megjelent a The Telegraph újságban, ahol nagy sikert ért el. Évente könyvek formájában is megjelent a The Sunday Telegraph kiadásában." },
	"l_15": { "lang": "A számítógépek elterjedése után természetesen a rejtvény digitális változataira sem kellett sokáig várni." },
	"l_16": { "lang": "Az interneten is sok oldal közöl grafilogikai rejtvényeket." },
	"l_17": { "lang": "A grafilogika szabályai" },
	"l_18": { "lang": "Az 5x5-ös négyzetekre osztott rács bal oldalán és tetején számok vannak." },
	"l_19": { "lang": "Elsőre ijesztőnek tűnhet ez, de könnyen meglehet érteni a logikáját." },
	"l_20": { "lang": "Induljunk el fordítva. Tanulmányozzuk a megfejtett ábrát, és nézzük meg, hogyan készült hozzá a számozás. A lényeg az, hogy az egybefüggő szigetet alkotó négyzetek számát kell összeszámolni." },
	"l_21": { "lang": "Kezdjük a sorokkal:" },
	"l_22": { "lang": "Az első sorban balról jobbra haladunk. Az üres négyzetek után találunk 3 összefüggő feketét, melyeket egy üres négyzet követ. Az első sor első száma tehát a 3. Utána következik néhány üres négyzet, majd megint 3 fekete kockát találunk." },
	"l_23": { "lang": "A második sorban is hasonló a helyzet, 3 fekete négyzetből álló szigetet követ 2 fekete négyzet. A szigetek között bármennyi fehér négyzet állhat, de minimum egynek kell lenni." },
	"l_24": { "lang": "Folytassuk az oszlopokkal:" },
	"l_25": { "lang": "A módszer ugyanaz, mint a soroknál, fentről lefelé haladva számoljuk össze a különálló szigeteket és írjuk fel a számokat fentről lefelé haladva." },
	"l_26": { "lang": "A színes grafilogikai feladványok felépítése hasonló a fekete-fehér rejtvényekéhez." },
	"l_27": { "lang": "A számokat a négyzetek színével megegyező színnel írjuk fel. Tehát a pink színű 9-es azt jelenti, hogy egymás után 9 egybefüggő pink  négyszer következik." },
	"l_28": { "lang": "Fontos különbség, hogy itt a különböző színű blokkok rögtön követhetik egymást, nem kell közöttük üres négyzetnek elhelyezkedni." },
	"l_29": { "lang": "Természetesen a grafilogikai feladványok megfejtésénél fordítva haladunk, a számok alapján kell az ábrát megrajzolni." },
	"l_30": { "lang": "A bátrabbak egyből neki is kezdhetnek egy rejtvénynek, de érdemes áttanulmányozni a szoftver használatát és a megoldási tippeket is. " },
	"l_31": { "lang": "Tovább olvasom" },
	"l_32": { "lang": "" },
	"l_33": { "lang": "" },
	"l_34": { "lang": "" },
	"l_35": { "lang": "" },
	"l_36": { "lang": "" },
	"l_37": { "lang": "" },
	"l_38": { "lang": "" },
	"l_39": { "lang": "" },
	"l_40": { "lang": "" }
}